src/cf/InformationRegisters/ПротоколАктуализацииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПротоколАктуализацииДанных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АктуализируемыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АктуализируемыйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоАктуализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаАктуализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПротоколАктуализацииДанных/Ext/ManagerModule.bsl
// Добавляет запись в протокол актуализации данных.
// 
// Параметры: Параметры Параметры
//  Период - Дата.
//  АктуализируемыйОбъект - ОпределяемыйТип.АктуализируемыйОбъект.
//  ПравилоАктуализации - ПеречислениеСсылка.ПравилаАктуализации.
//  Комментарий - Строка.
// 
// Возвращаемое значение:
//  
Процедура Записать(Период, АктуализируемыйОбъект, ПравилоАктуализации, Комментарий) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.АктуализируемыйОбъект.Установить(АктуализируемыйОбъект);
	НаборЗаписей.Отбор.ПравилоАктуализации.Установить(ПравилоАктуализации);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.АктуализируемыйОбъект = АктуализируемыйОбъект;
	НоваяЗапись.ПравилоАктуализации = ПравилоАктуализации;
	НоваяЗапись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
